spec/sem4r/bulk_mutate_job/fixtures/get-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/job/v200909/BulkMutateJobService' -->
<?xml version='1.0' encoding='UTF-8'?> 
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:env='http://schemas.xmlsoap.org/soap/envelope/' xmlns='https://adwords.google.com/api/adwords/cm/v200909' xmlns:s='https://adwords.google.com/api/adwords/cm/v200909'>
  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>
        ***censured***
      </authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>
        ***censured***
      </developerToken>
    </s:RequestHeader>
  </env:Header>
  <env:Body>
    <get xmlns='https://adwords.google.com/api/adwords/cm/v200909'>
      <selector>
        <customerJobKeys/>
        <jobStatuses>
          COMPLETED
        </jobStatuses>
        <jobStatuses>
          PROCESSING
        </jobStatuses>
        <jobStatuses>
          FAILED
        </jobStatuses>
        <jobStatuses>
          PENDING
        </jobStatuses>
      </selector>
    </get>
  </env:Body>
</env:Envelope>
